controllers/CampaignController.php

SELECT EXISTS(SELECT * FROM `campaign` WHERE `campaign`.`campaignID`='2')
---
      public function actionSinglecode($id)
    {

		        $model = new CCodes();
				$campaignModel = $this->findModel($id);

		$model->dateCreated =  new Expression('NOW()');
		$model->campaignID= 	$campaignModel->campaignID;
		$model->settingName = 	$campaignModel->campaignName;
		$model->type  = 	1 ;
	$model->scenario="singlecode-create";



  if(Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())) {
      \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
      return \yii\widgets\ActiveForm::validate($model);
    }

        if ($model->load(Yii::$app->request->post())  & $model->validate()) {{

INSERT INTO `ccodes` (`dateCreated`, `campaignID`, `settingName`, `type`, `cCount`, `insertedBy`, `updatedBy`, `status`, `clientID`) VALUES (NOW(), 2, 'Test', 1, 5, 1, 1, 1, 1)
INSERT INTO `cCodeEntries` (`cCodeID`, `clientID`, `type`, `code`, `insertedBy`, `updatedBy`, `dateCreated`) VALUES (24, 1, 1, 'wdewf', 1, 1, NOW()), (24, 1, 1, 'wefew', 1, 1, NOW()), (24, 1, 1, 'qweew', 1, 1, NOW()), (24, 1, 1, 'wdwdw', 1, 1, NOW())
---
			$insArr[] = [$model->codeID,yii::$app->user->identity->clientID,1,$num,yii::$app->user->identity->userID,yii::$app->user->identity->userID,new Expression('NOW()')];


		 $savedRecs += \Yii::$app->db->createCommand()
  ->batchInsert("cCodeEntries",["cCodeID","clientID","type","code","insertedBy","updatedBy","dateCreated"],$insArr)->execute();

SELECT * FROM `campaign` WHERE `campaignID`='2'
---
    protected function findModel($id)
    {
        if (($model = Campaign::findOne($id)) !== null) {