components/CoreUtils.php

SELECT SUM(creditsAllocated) FROM `creditAllocation` WHERE (`creditStatusID`=1) AND (`clientID`='1')
SELECT SUM(creditsConsumed) FROM `creditConsumption` WHERE (`creditStatusID`=1) AND (`clientID`='1')
---
public function getClientCredit()
{
$creditAllocated = CreditAllocation::find()->where(['creditStatusID' =>StatusCodes::ACTIVE,'clientID'=>yii::$app->user->identity->clientID])->sum("creditsAllocated");
$creditConsumed  = CreditConsumption::find()->where(['creditStatusID' =>StatusCodes::ACTIVE,'clientID'=>yii::$app->user->identity->clientID])->sum("creditsConsumed");