models/User.php

SELECT * FROM `users` WHERE (`userID`=1) AND (`passwordStatusID`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['userID' => $id, 'passwordStatusID' => self::STATUS_ACTIVE]);

SELECT * FROM `users` WHERE (`userName`='thesuperAdminAccount') AND (`active`=1)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'passwordStatusID' => self::STATUS_ACTIVE]);